<!-- add-pr-comment:manifest_secrets_plan -->

# production/manifest_secrets Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_secretsmanager_secret_version.manifest_signoz_smtp_password[0] must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_signoz_smtp_password" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:MANIFEST_SIGNOZ_SMTP_PASSWORD-mQU9xB" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:MANIFEST_SIGNOZ_SMTP_PASSWORD-mQU9xB|terraform-20260317142740164000000008" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260317142740164000000008" -> (known after apply)
      ~ version_stages       = [
          - "AWSPREVIOUS",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }
  # aws_secretsmanager_secret_version.manifest_signoz_smtp_username[0] must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_signoz_smtp_username" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:MANIFEST_SIGNOZ_SMTP_USERNAME-M7Hh5K" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:MANIFEST_SIGNOZ_SMTP_USERNAME-M7Hh5K|terraform-20260317142740161700000006" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260317142740161700000006" -> (known after apply)
      ~ version_stages       = [
          - "AWSPREVIOUS",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }
Plan: 2 to add, 0 to change, 2 to destroy.

# --- End of Plan 1 ---

```